app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def inventory
    product = Product.find(params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def description
    product = Product.find(params[:id])

INSERT INTO "products" ("name", "description", "inventory", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["description", "This is a great thing"], ["inventory", 12], ["price", 3], ["created_at", "2016-02-21 05:20:39.420206"], ["updated_at", "2016-02-21 05:20:39.420206"]]
---
  def create
    Product.create(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 339]]
---
  def show
    @product = Product.find(params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 338]]
---
  def data
    product = Product.find(params[:id])